Java-Basic/java-annotation.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2018-11-22 周四 01:50 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Annotation(注解)</title>
<meta name="generator" content="Org mode">
<meta name="author" content="孙悟空">
<link rel='stylesheet' href='/asset/common.css' />
</head>
<body>
<div id="content">
<header>
<h1 class="title">Annotation(注解)</h1>
</header><nav id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgc996410">1. 注解的定义</a>
<ul>
<li><a href="#org48f99bb">1.1. 创建</a></li>
<li><a href="#orgf0821d0">1.2. @Target</a></li>
<li><a href="#orgbb32db7">1.3. @Retention</a></li>
<li><a href="#org2fff28b">1.4. @Documented</a></li>
<li><a href="#orgc2e2d94">1.5. @Inherited</a></li>
</ul>
</li>
<li><a href="#orgcf9a32d">2. 注解的使用</a></li>
<li><a href="#orgbb6f895">3. JDK 内置注解</a></li>
</ul>
</div>
</nav>




<section id="outline-container-orgc996410" class="outline-2">
<h2 id="orgc996410"><span class="section-number-2">1</span> 注解的定义</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org48f99bb" class="outline-3">
<h3 id="org48f99bb"><span class="section-number-3">1.1</span> 创建</h3>
<div class="outline-text-3" id="text-1-1">
<div class="org-src-container">
<pre class="src src-java"><span class="org-c-annotation">@Target</span>({<span class="org-constant">ElementType</span>.Type})
<span class="org-c-annotation">@Retention</span>(<span class="org-constant">RetentionPolicy</span>.<span class="org-type">RUNTIME</span>)
<span class="org-keyword">public</span> <span class="org-keyword">@interface</span> <span class="org-type">Fruit</span> {
    <span class="org-type">String</span> <span class="org-function-name">value</span>() <span class="org-keyword">default</span> <span class="org-string">""</span>;
    <span class="org-type">String</span> <span class="org-function-name">name</span>() <span class="org-keyword">default</span> <span class="org-string">"noname"</span>;
    <span class="org-type">float</span> <span class="org-function-name">price</span>() <span class="org-keyword">default</span> 0;
}

<span class="org-comment-delimiter">// </span><span class="org-comment">1. &#21019;&#24314;&#30340;&#35821;&#27861;&#36319;&#25509;&#21475;&#38750;&#24120;&#20687;</span>
<span class="org-comment-delimiter">// </span><span class="org-comment">2. &#21487;&#20197;&#36890;&#36807; default &#35821;&#21477;&#32473;&#19982;&#40664;&#35748;&#20540;</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgf0821d0" class="outline-3">
<h3 id="orgf0821d0"><span class="section-number-3">1.2</span> @Target</h3>
<div class="outline-text-3" id="text-1-2">
<p>
目标。
</p>

<p>
表示这个注解可以放到哪些元素上面。如果不设定，那么注解可以放置到任何元素上。
</p>

<p>
可以有很多选项，比如:
</p>
<ul class="org-ul">
<li>ElementType.TYPE，可以放到类、接口、枚举类上面</li>
<li>ElementType.METHOD，可以放到方法上面</li>
<li>ElementType.PARAMETER，可以放到参数上面</li>
</ul>

<p>
更多，请查看 ElementType 的源码。
</p>
</div>
</div>

<div id="outline-container-orgbb32db7" class="outline-3">
<h3 id="orgbb32db7"><span class="section-number-3">1.3</span> @Retention</h3>
<div class="outline-text-3" id="text-1-3">
<p>
保留。
</p>

<p>
有三种策略:
</p>
<ul class="org-ul">
<li>RetentionPolicy.SOURCE</li>
<li>RetentionPolicy.CLASS [默认]</li>
<li>RetentionPolicy.RUNTIME</li>
</ul>

<p>
添加的注解会被保留到什么步骤。
</p>

<p>
一个 Xxx.java 从产生到执行，会经历这样的步骤
</p>
<pre class="example">
Xxx.java --javac--&gt; Xxx.class --java--&gt; 机器码执行
</pre>

<p>
执行 javac 的过程，叫编译时(Compile)；
</p>

<p>
执行 java 的过程，叫运行时(Runtime)；
</p>

<p>
如果 @Retention 策略设置为:
</p>
<ul class="org-ul">
<li>SOURCE，那么在 javac 阶段注解会有效，编译之后注解将会被抛弃</li>
<li>CLASS，那么注解将会被编译到 class 文件中，但它不能在运行时通过反射获取</li>
<li>RUNTIME，那么注解将会被编译到 class 文件中，并能在运行时通过反射获取</li>
</ul>
</div>
</div>

<div id="outline-container-org2fff28b" class="outline-3">
<h3 id="org2fff28b"><span class="section-number-3">1.4</span> @Documented</h3>
<div class="outline-text-3" id="text-1-4">
<p>
表示是否允许 javadoc 或相关工具为这个注解生成文档
</p>
</div>
</div>

<div id="outline-container-orgc2e2d94" class="outline-3">
<h3 id="orgc2e2d94"><span class="section-number-3">1.5</span> @Inherited</h3>
<div class="outline-text-3" id="text-1-5">
<p>
表示注解是否可以被子类继承。
</p>
</div>
</div>
</section>



<section id="outline-container-orgcf9a32d" class="outline-2">
<h2 id="orgcf9a32d"><span class="section-number-2">2</span> 注解的使用</h2>
<div class="outline-text-2" id="text-2">
<p>
首先，在需要的地方，添加注解:
</p>
<div class="org-src-container">
<pre class="src src-java"><span class="org-c-annotation">@Fruit</span>(name = <span class="org-string">"apple"</span>, price = 33)
<span class="org-keyword">public</span> <span class="org-keyword">class</span> <span class="org-type">Apple</span> {
    <span class="org-comment-delimiter">// </span><span class="org-comment">...</span>
}
</pre>
</div>

<p>
三个重要的方法:
</p>
<ul class="org-ul">
<li>isAnnotationPresent()</li>
<li>getAnnotation()</li>
<li>getAnnotations()</li>
</ul>

<p>
使用示例:
</p>
<div class="org-src-container">
<pre class="src src-java"><span class="org-comment-delimiter">// </span><span class="org-comment">&#33719;&#21462; Apple &#30340;&#31867;&#23545;&#35937;</span>
<span class="org-type">Class</span> <span class="org-variable-name">aClass</span> = Apple.<span class="org-keyword">class</span>;

<span class="org-keyword">if</span> (aClass.isAnnotationPresent(Fruit.<span class="org-keyword">class</span>)) {      <span class="org-comment-delimiter">// </span><span class="org-comment">&#21028;&#26029; Apple &#19978;&#38754;&#26159;&#21542;&#26631;&#27880;&#20102; Fruit &#27880;&#35299;</span>
    <span class="org-type">Fruit</span> <span class="org-variable-name">anno</span> = aClass.getAnnotation(Fruit.<span class="org-keyword">class</span>); <span class="org-comment-delimiter">// </span><span class="org-comment">&#36890;&#36807;&#21453;&#23556;&#30340;&#26041;&#24335;&#65292;&#33719;&#21462; Apple &#19978;&#38754;&#30340; Fruit &#27880;&#35299;&#30340;&#23454;&#20363;</span>

    <span class="org-type">String</span> <span class="org-variable-name">name</span> = anno.name(); <span class="org-comment-delimiter">// </span><span class="org-comment">&#21487;&#20197;&#20687;&#35843;&#29992;&#26222;&#36890;&#26041;&#27861;&#19968;&#26679;&#35843;&#29992;&#65292;&#20174;&#32780;&#33719;&#21462;&#21442;&#25968;</span>
    <span class="org-type">float</span> <span class="org-variable-name">price</span> = anno.price();

    System.out.println(name + <span class="org-string">"&#30340;&#20215;&#26684;&#20026;"</span> + price);
}

</pre>
</div>
</div>
</section>

<section id="outline-container-orgbb6f895" class="outline-2">
<h2 id="orgbb6f895"><span class="section-number-2">3</span> JDK 内置注解</h2>
<div class="outline-text-2" id="text-3">
<ul class="org-ul">
<li>@Override, 重载</li>
<li>@SuppressWarnings, 抑制警告信息</li>
<li>@Deprecated, 标注方法已过时，那么在编译的时候，编译器会发出相关警告</li>
<li>@SafeVarargs</li>
<li>@FunctionInterface</li>
</ul>
</div>
</section>
</div>
<div id="postamble" class="status">
<p class="author">Author: 孙悟空</p>
<p class="date">Created: 2018-11-22 周四 01:50</p>
<p class="validation">Go ahead, never stop.</p>
</div>
</body>
</html>
